run/simpleRotor/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    overset2
    {
        type            overset;
        inGroups        1(overset);
        nFaces          160;
        startFace       12832;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          288;
        startFace       12992;
    }
    hole
    {
        type            wall;
        inGroups        1(wall);
        nFaces          0;
        startFace       13280;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          13056;
        startFace       13280;
    }
)

// ************************************************************************* //
